app/controllers/api/v1/shops_controller.rb

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]
---
def set_article
  @shop = Shop.find(params[:id])