app/controllers/api/v1/stores_controller.rb

def set_article
  @store = Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]