app/controllers/sessions_controller.rb

SELECT  "shops".* FROM "shops" WHERE (email_id = 'vinoth@gmail.com')  ORDER BY "shops"."id" DESC LIMIT 1
---
def create
    shop = Shop.where("email_id = ?", params[:email_id]).last