app/controllers/shops_controller.rb

	def create
		shop = Shop.new(shop_params)
           if shop.save
---
INSERT INTO "shops" ("owner_name", "address", "email_id", "store_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["owner_name", "Raj"], ["address", "chennai"], ["email_id", "raj@gmail.com"], ["store_id", 1], ["created_at", "2021-03-17 01:28:09.101434"], ["updated_at", "2021-03-17 01:28:09.101434"]]

	def show
		@shop=Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@shop=Shop.find(params[:id])
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]

	def update
           @shop = Shop.find(params[:id])
          if @shop.update(shop_params)
---
SELECT  "shops".* FROM "shops" WHERE "shops"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "shops" SET "shop_type" = ?, "updated_at" = ? WHERE "shops"."id" = ?  [["shop_type", "Content"], ["updated_at", "2021-03-17 01:30:21.319939"], ["id", 1]]