app/controllers/stores_controller.rb

	def create
		@store = Store.new(store_params)
           if @store.save
---
INSERT INTO "stores" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "vinoth"], ["address", "bangalore"], ["created_at", "2021-03-17 01:26:01.221431"], ["updated_at", "2021-03-17 01:26:01.221431"]]

	def show
		@store=Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]

	def edit
		@store=Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]

	def update
        @store = Store.find(params[:id])
          if @store.update(store_params)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "stores" SET "address" = ?, "updated_at" = ? WHERE "stores"."id" = ?  [["address", "bangalore."], ["updated_at", "2021-03-17 01:26:11.156106"], ["id", 1]]